In [2]:
import pandas as pd
import numpy as np

In [29]:
df = pd.DataFrame(np.random.randint(10, size=(8, 4)), columns=['col1', 'col2', 'col3', 'col4'])
df

   col1  col2  col3  col4
0     8     5     7     3
1     6     4     2     6
2     5     3     7     5
3     9     8     7     4
4     5     2     0     3
5     7     2     4     5
6     4     9     9     2
7     5     0     4     5

## .head()

In [23]:
# Visualizando as 5 primeiras linhas
df.head()

   col1  col2  col3  col4
0     5     3     6     9
1     8     9     0     1
2     4     9     5     9
3     6     8     6     4
4     4     6     1     2

In [24]:
# Visualizando as primeiras n linhas (trÃªs neste caso)
df.head(3)

   col1  col2  col3  col4
0     5     3     6     9
1     8     9     0     1
2     4     9     5     9

In [30]:
# Para valores negativos de n
df = df.head(-3)
df

   col1  col2  col3  col4
0     8     5     7     3
1     6     4     2     6
2     5     3     7     5
3     9     8     7     4
4     5     2     0     3

## .tail

In [32]:
df

   col1  col2  col3  col4
0     8     5     7     3
1     6     4     2     6
2     5     3     7     5
3     9     8     7     4
4     5     2     0     3

In [34]:
# Visualizando as Ãºltimas 5 linhas
df.tail()

   col1  col2  col3  col4
0     8     5     7     3
1     6     4     2     6
2     5     3     7     5
3     9     8     7     4
4     5     2     0     3

In [36]:
# Visualizando as Ãºltimas n linhas (trÃªs neste caso)
df.tail(3)

   col1  col2  col3  col4
2     5     3     7     5
3     9     8     7     4
4     5     2     0     3

In [38]:
# Para valores negativos de n
df.tail(-3)

   col1  col2  col3  col4
4     5     2     0     3

## .at

In [65]:
df

   col1  col2  col3  col4
0    55     3     1     0
1     0     4     9     8
2     6     7     4     9
3     2     5     5     1
4     6     4     6     5

In [49]:
# Obtenha o valor no par de linha/coluna especificado

df.at[0, 'col1']  # [0,0]

9

In [54]:
# Defina o valor no par de linha / coluna especificado
df.at[0, 'col1'] = 55
df.at[0, 'col1']

55

In [60]:
# Gerando serie da linha 2
df.loc[2]

col1    6
col2    7
col3    4
col4    9
Name: 2, dtype: int32

In [63]:
# Obtenha valor dentro de uma sÃ©rie
df.loc[2].at['col4']

9

## .iat

In [64]:
df

   col1  col2  col3  col4
0    55     3     1     0
1     0     4     9     8
2     6     7     4     9
3     2     5     5     1
4     6     4     6     5

In [68]:
# Obtenha o valor no par de linha / coluna especificado
df.iat[0, 0]

55

In [81]:
# Defina o valor no par de linha / coluna especificado
df.iat[0, 0] = 9
df.iat[0, 0]

9

In [82]:
# Gerando serie da linha 1
df.loc[1]

col1    0
col2    4
col3    9
col4    8
Name: 1, dtype: int32

In [83]:
# Obtenha valor dentro de uma sÃ©rie
df.loc[1].iat[1]

4

## .loc

In [36]:
df = pd.DataFrame(data=np.random.randint(10, size=(4, 4)), index=['L1', 'L2', 'L3', 'L4'], columns=['C1', 'C2', 'C3', 'C4'])
df

    C1  C2  C3  C4
L1   8   2   6   9
L2   3   0   0   1
L3   8   2   2   4
L4   5   6   1   0

In [37]:
# Etiqueta Ãºnica. Observe que isso retorna a linha como uma sÃ©rie.
df.loc['L1']

C1    8
C2    2
C3    6
C4    9
Name: L1, dtype: int32

In [38]:
# Lista de rÃ³tulos. Observe que usar [[]] retorna um DataFrame.
df.loc[['L1', 'L3']]

    C1  C2  C3  C4
L1   8   2   6   9
L3   8   2   2   4

In [39]:
# RÃ³tulo Ãºnico para linha e coluna
df.loc['L1', 'C3']

6

In [40]:
# atia com rÃ³tulos para linha e rÃ³tulo Ãºnico para coluna. Conforme mencionado acima, 
# observe que o inÃ­cio e a parada da fatia estÃ£o incluÃ­dos.

df.loc['L2': 'L4', 'C2'] # do L2 ao L4 da coluna C2

L2    0
L3    2
L4    6
Name: C2, dtype: int32

In [41]:
# Lista booleana com o mesmo comprimento do eixo da linha

df.loc[[False, False, True, False]]

    C1  C2  C3  C4
L3   8   2   2   4

In [42]:
# Condicional que retorna uma sÃ©rie booleana
df.loc[df['C3'] > 5]  # Exibir valores da C3 menor que 5

    C1  C2  C3  C4
L1   8   2   6   9

In [43]:
df.loc[df['C3'] > 5, ['C4']] # exibindo somente a coluna especificada

    C4
L1   9

In [44]:
# Lambda que retorna uma sÃ©rie booleana
df.loc[lambda df: df['C3'] == 9]

Empty DataFrame
Columns: [C1, C2, C3, C4]
Index: []

### .loc (Valores de configuraÃ§Ã£o)

In [45]:
df

    C1  C2  C3  C4
L1   8   2   6   9
L2   3   0   0   1
L3   8   2   2   4
L4   5   6   1   0

In [46]:
# Defina o valor para todos os itens que correspondem Ã  lista de rÃ³tulos
df.loc[['L3', 'L1'], ['C3']] = 50
df

    C1  C2  C3  C4
L1   8   2  50   9
L2   3   0   0   1
L3   8   2  50   4
L4   5   6   1   0

In [47]:
# Defina o valor para uma linha inteira
df.loc['L1'] = 20
df

    C1  C2  C3  C4
L1  20  20  20  20
L2   3   0   0   1
L3   8   2  50   4
L4   5   6   1   0

In [48]:
# Defina o valor para uma coluna inteira
df.loc[:, 'C3'] = 30
df

    C1  C2  C3  C4
L1  20  20  30  20
L2   3   0  30   1
L3   8   2  30   4
L4   5   6  30   0

In [49]:
# Defina o valor para as linhas que correspondem Ã  condiÃ§Ã£o de chamada
df.loc[df['C2'] != 20] = 0
df

    C1  C2  C3  C4
L1  20  20  30  20
L2   0   0   0   0
L3   0   0   0   0
L4   0   0   0   0

### Obter valores em um DataFrame com um Ã­ndice que possui rÃ³tulos de inteiros

In [62]:
df = pd.DataFrame(np.random.randint(10, size=(6, 2)),
     columns=['max_speed', 'shield'])
df

   max_speed  shield
0          3       4
1          3       2
2          1       8
3          4       9
4          7       7
5          4       0

In [64]:
# Fatia com rÃ³tulos inteiros para linhas. Conforme mencionado acima, observe que o inÃ­cio e a parada da fatia estÃ£o incluÃ­dos.
df.loc[2:4]

   max_speed  shield
2          1       8
3          4       9
4          7       7

### Obtendo valores com um MultiIndex

In [6]:
tuplas = [('Gol', 'motor v1'), ('Gol', 'motor v2'), ('Gol GTi', 'motor v1'), ('Gol GTi', 'motor v2')]
index = pd.MultiIndex.from_tuples(tuplas)
values = [[120, 20], [180, 35],[250, 50], [300, 60]]
df = pd.DataFrame(values, columns=['velocidade', '+turbo'], index=index)
df

                  velocidade  +turbo
Gol     motor v1         120      20
        motor v2         180      35
Gol GTi motor v1         250      50
        motor v2         300      60

In [7]:
# Etiqueta Ãºnica. Observe que isso retorna um DataFrame com um Ãºnico Ã­ndice. 
df.loc['Gol']

          velocidade  +turbo
motor v1         120      20
motor v2         180      35

In [8]:
# Tupla de Ã­ndice Ãºnico. Observe que isso retorna uma sÃ©rie. 
df.loc[('Gol', 'motor v1')]

velocidade    120
+turbo         20
Name: (Gol, motor v1), dtype: int64

In [9]:
# Tupla de Ã­ndice Ãºnico. Observe que isso retorna uma sÃ©rie
df.loc['Gol GTi', 'motor v2']

velocidade    300
+turbo         60
Name: (Gol GTi, motor v2), dtype: int64

In [10]:
# Tupla Ãºnica. Observe que o uso de [[]] retorna um DataFrame.
df.loc[[('Gol', 'motor v1')]]

              velocidade  +turbo
Gol motor v1         120      20

In [11]:
# Tupla Ãºnica para o Ã­ndice com um Ãºnico rÃ³tulo para a coluna
df.loc[('Gol', 'motor v2'), 'velocidade']

180

In [12]:
# Corte da tupla de Ã­ndice para rÃ³tulo Ãºnico
df.loc[('Gol', 'motor v1'): ('Gol GTi', 'motor v1')]

                  velocidade  +turbo
Gol     motor v1         120      20
        motor v2         180      35
Gol GTi motor v1         250      50